{"data":[{"id":9,"title":"Criando aplicações PHP MVC\/MVVM com Zend Framework 3","shortDescription":"O objetivo deste curso é habilitar programadores a desenvolver aplicações web com PHP utilizando soluções reusáveis de software orientado a objetos implementadas pelo projeto Zend Framework em sua terceira versão.<br \/>Neste curso o aluno aprenderá a criar um projeto PHP utilizando o IDE livre e aberto Zend Eclipse PHP para edição de código-fonte e alguns dos componentes do Zend Framework. O curso é totalmente prático, de modo que os conceitos são apresentados a medida que os alunos codificam. ","description":"Este curso tornará o aluno apto a escrever aplicações PHP sobre as quais tenha controle da complexidade e com delegação de tarefas que não estejam relacionadas com o negócio de seu cliente para componentes especializados.<br \/>Além de aprender a utilizar um framework, que consiste na implementação de padrões de projeto, o aluno trabalhará com um ambiente integrado de desenvolvimento e terá noções de desenvolvimento com controle de versão.<br \/>Inicialmente o aluno conhecerá as principais funcionalidades do Zend Eclipse PHP. Em seguida ele aprenderá como funciona a configuração de programas externos no Eclipse, que permite a integração com qualquer programa que possa ser executado via terminal. Na sequência ele verá como se dá a criação e configuração de projeto PHP no Eclipse  e a criação de projeto PHP a partir do esqueleto de aplicação do Zend Framework.<br \/>Na segunda parte, o aluno aprenderá a criar e configurar módulos e nesta etapa aprenderá os conceitos de modularidade e configuração implementados pelo Zend Framework. Em seguida ele verá como é a criação e configuração de controladores, de visões e layouts.<br \/>Na terceira parte, o aluno construirá um cadastro realizando persistência em banco de dados relacional. Na quarta parte, o aluno fará de forma orientada outro cadastro, que tenha relacionamento com o primeiro.<br \/>Ao final do curso, o aluno terá não somente o código-fonte de uma aplicação funcional, que compreende os fundamentos da maioria das aplicações web, como terá as diversas versões com as etapas da construção, que poderá consultar para rever os passos dados.","requirements":"Conhecimento da linguagem de programação PHP e de programação orientada a objetos","type":"course","date":null,"startTime":null,"endTime":null,"room":null,"speaker":{"id":122,"name":"Flávio Gomes da Silva Lisboa","description":"Bacharel em Ciência da Computação com pós-graduação em Aplicações Corporativas usando Orientação a Objetos e Tecnologia Java pela e mestrando em Tecnologia e Sociedade pela UTFPR. É funcionário do SERPRO e autor dos livros: Zend Framework Desenvolvendo em PHP 5 Orientado a Objetos com MVC, Zend Framework Componentes Poderosos para PHP (2ª ed.),Criando Aplicações PHP com Zend e Dojo (2ª ed.) e Orquestrando Aplicações PHP com Symfony usando ORM Doctrine. É Zend PHP Certified Engineer, Zend Framework Certified Engineer, Zend Framework 2 Certified Architect. Tem experiência na área de Ciência da Computação, com ênfase em Software Livre. Sua especialidade é arquitetura de software. Atualmente faz pesquisa em Economia Solidária e Tecnologia Social.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/27dbee7afb8f0dc09b22124a931bcb5f.png","0":"png"},"links":[{"rel":"self","uri":"\/talks\/9"}]},{"id":35,"title":"Preparatório para a certificação Zend Certified PHP Engineer 2017-PHP - exame 200-710 (baseado no PHP 7.1)","shortDescription":"O exame \"Zend Certified PHP Engineer\" (ZCPE) é promovido pela Rogue Wave Zend - mantenedora da linguagem PHP.<br \/>Esse preparatório é um curso presencial de imersão com o objetivo de capacitar os profissionais na obtenção do título de ZCPE: certificação baseada na versão 7.1 do PHP (exame 200-710).","description":"O objetivo do treinamento é preparar os profissionais, já proficientes na linguagem, a conquistarem o título como Zend Certified PHP Engineer 2017-PHP versão 7.1 (exame 200-710).<br \/>O curso destina-se a desenvolvedores web experientes que almejam o título para atestar seus conhecimentos avançados em PHP.","requirements":"Conhecimento intermediário e avançado da linguagem PHP","type":"course","date":null,"startTime":null,"endTime":null,"room":null,"speaker":{"id":256,"name":"Ari Stopassola Junior","description":"Bacharel em Informática com ênfase em Análise de Sistemas (Unisinos), estudou na Universidade Técnica de Lisboa (Portugal), é Zend Certified Engineer (PHP 5.3), Zend Certified PHP Engineer (PHP 5.5), Rogue Wave Zend Certified Engineer 2017-PHP (PHP 7.1), Zend Framework 2 Certified Architect (ZFCA), Certified ScrumMaster pela Scrum Alliance, Microsoft Certified Professional (MCP), idealizador do curso Certificamp, consultor web e PHP evangelist.<br \/>Atualmente é discente de pós-graduação em Computação Forense & Perícia Digital, mantenedor do site Perito.inf.br e criador do TopTrumPHPs - SuperTrunfo de frameworks PHP.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/91d6ecd92e54cf733b90b5335aaf2c6d.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/35"}]},{"id":73,"title":"Build and Ship de Aplicações com Jenkins e Docker","shortDescription":"Neste curso iremos aprender um pouco mais sobre o Docker e também sobre a instalação do Docker no seu ambiente trabalhando com containers com Jenkins 2 os Slaves do Jenkins também em containers. ","description":"Neste curso iremos aprender um pouco mais sobre o Docker e também sobre a instalação do Docker no seu ambiente. Também abordar a instalação e configuração do Jenkins 2, nova versão do software de CI que está entre os mais utilizados do mundo. Aprenderemos mais sobre a integração nativa que a versão 2 tem com o Docker, Pipelines, Pipelines as Code serviços de notificação e montaremos o nosso ambiente de Build, Ship e Deploy utilizando o jenkins e enviando os containers para um hub privado (com ou sem https). Por fim, iremos fazer o deploy e monitoramento dos containers utilizando o Rancher, uma poderosa ferramenta integrada junto ao docker.","requirements":"Unix Command Line, Noções básicas de deploy, PHP básico","type":"course","date":null,"startTime":null,"endTime":null,"room":null,"speaker":{"id":212,"name":"Jefferson Souza","description":"Programador PHP a 7 anos, participante da comunidade Carioca de desenvolvedores PHP. Gosto de estar por dentro de novas tecnologias e de soluções que agilizem o desenvolvimento e otimize a performance.  Tenho trabalhado com desenvolvimento mobile paralelamente à mais de 2 anos e tenho tido ótimas experiências com o mundo mobile. ","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/b496c72d47b552104047ebe10c6cb571.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/73"}]},{"id":74,"title":"Chatbots: Criando um atendimento automatizado para seu negócio.","shortDescription":"Chatbots permitem que usuários se comuniquem com software via texto e voz, utilizando Inteligência Artificial e Processamento de Linguagem Natural para interpretar o que o que foi dito pelo usuário, redirecionando-o assim para a ação a ser realizada. <br \/>Melhore o engajamento com sua audiência, automatize suas mensagens de suporte e aumente suas vendas com um chatbot.","description":"Atualmente, presenciamos uma realidade de mercado em que o grande problema é a sobrecarga das equipes de atendimento, sendo que mais de 60% das dúvidas geradas pelos consumidores são simples e poderiam, facilmente, ser solucionadas de forma automatizada. Além disso, há a questão das demandas reprimidas que, muitas vezes, deixam de ser atendidas por falta de braços. Você já deve ter ouvido algumas frases como \"você é o décimo da fila\" ou \"o seu tempo de espera é de alguns minutos\" Portanto, a grande vantagem de apostar em um chatbot no atendimento multicanal é desafogar a operação, evitando que os atendentes humanos despendam tempo e esforço para solucionar problemas simples, como gerar a segunda via de um boleto, consultar um extrato bancário, rastrear  o status de um pedido de compra online, realizar agendamentos ou até mesmo saber qual loja física está mais próxima da casa do consumidor. Lembre-se: estamos atendendo um público com um perfil cada vez mais exigente, focado em ferramentas digitais e que procura agilidade para resolver as suas questões.<br \/><br \/>Vamos compreender o que é um bot e suas possibilidades de utilização no contexto do marketing digital e das mídias sociais e ferramentas para criação de bots para atendimento personalizado.","requirements":"Conhecimentos básicos de programação, PHP, Orientação a Objetos)","type":"course","date":null,"startTime":null,"endTime":null,"room":null,"speaker":{"id":156,"name":"Jackson F. de A. mafra","description":"Desenvolvedor web desde 1998, com background em projetos de e-commerce e real estate, desde 2009 com interesses focados para o desenvolvimento de interfaces móveis e aplicações MEAP.<br \/>Palestrante, Instrutor, atualmente é Lider Técnico na Tolv12 e atua com os Bots das plataformas de atendimento.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/897dba9a57509f35c73e08ecf2965910.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/74"}]},{"id":11,"title":"Estudo de Caso: a utilização de PHP no Serviço Federal de Processamento de Dados","shortDescription":"O objetivo desta palestra é apresentar a relação de sistemas desenvolvidos com a linguagem de programação PHP que estão em produção no Serviço Federal de Processamento de Dados e as possibilidade de serviço para governo e empresas.","description":"Iniciaremos a palestra com uma apresentação sobre o Serviço Federal de Processamento de Dados, sua história e área de atuação.<br \/>Em seguida falaremos sobre o Programa Serpro de Software Livre e alguns de seus indicadores.<br \/>Finalmente, apresentaremos uma a uma as aplicações desenvolvidas pelo SERPRO utilizando a linguagem de programação PHP, com o detalhamento sobre o negócio de cada uma.<br \/>","requirements":"Não há pré-requisitos, a palestra é aberta a todos","type":"talk","date":"2017-12-07","startTime":"14:30","endTime":"15:30","room":"Sala Elton Minetto","speaker":{"id":122,"name":"Flávio Gomes da Silva Lisboa","description":"Bacharel em Ciência da Computação com pós-graduação em Aplicações Corporativas usando Orientação a Objetos e Tecnologia Java pela e mestrando em Tecnologia e Sociedade pela UTFPR. É funcionário do SERPRO e autor dos livros: Zend Framework Desenvolvendo em PHP 5 Orientado a Objetos com MVC, Zend Framework Componentes Poderosos para PHP (2ª ed.),Criando Aplicações PHP com Zend e Dojo (2ª ed.) e Orquestrando Aplicações PHP com Symfony usando ORM Doctrine. É Zend PHP Certified Engineer, Zend Framework Certified Engineer, Zend Framework 2 Certified Architect. Tem experiência na área de Ciência da Computação, com ênfase em Software Livre. Sua especialidade é arquitetura de software. Atualmente faz pesquisa em Economia Solidária e Tecnologia Social.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/27dbee7afb8f0dc09b22124a931bcb5f.png","0":"png"},"links":[{"rel":"self","uri":"\/talks\/11"}]},{"id":33,"title":"Cuidando bem das senhas","shortDescription":"A velocidade cada vez maior dos nossos processadores e as facilidades da computação em nuvem nos traz a atenção aos cuidados ao acesso aos nossos sistemas. Essa palestra traz um panorama de como lidar com a segurança das senhas dos nossos clientes e de como garantir a integridade de suas informações","description":"Passaremos por dicas de bibliotecas, lembretes de como lidar com as senhas do usuário, fazendo assim o desenvolvedor iniciante ou não prestar atenção a estes pequenos detalhes no conjunto de segurança da informação.","requirements":"Nenhum","type":"talk","date":"2017-12-07","startTime":"14:30","endTime":"15:30","room":"Sala Er Galvão","speaker":{"id":323,"name":"Vanildo Souto Mangueira","description":"Analista programador, gamer, entusiasta Linux e curioso, muito curioso","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/8e17e0681bad248b8ac94dcd8f34e306.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/33"}]},{"id":29,"title":"Scraping e Crawling com PHP","shortDescription":"Etapas no desenvolvimento de uma aplicação que basicamente consiste em buscar informações em outros sites.<br \/>Melhores práticas. <br \/>Problemas encontrados.<br \/>Curl vs file_get_contents vs Selenium<br \/>Expressões regulares vs DOM<br \/>O que fazer com os dados obtidos","description":"Principais etapas num processo de crawling<br \/>1- obtendo uma listagem atraves de buscas.<br \/>2 - resolvendo paginacao<br \/>3 - acessando os detalhes ou perfil daquilo que se quer buscar<br \/>4 - efetuando o scraping do html<br \/>5 - salvando no BD<br \/>6 - E Agora ? Qual a pergunta a responder ? ","requirements":"php html","type":"talk","date":"2017-12-07","startTime":"14:30","endTime":"15:30","room":"Sala Flavio Lisboa","speaker":{"id":290,"name":"L Gustavo Almeida","description":"Zend Certified Engineer<br \/>LPI nivel 1 e 2<br \/>Atualmente faco mestrado na PUC-RJ<br \/>Instrutor Impacta<br \/>FreeLancer","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/de47a1a8696c0d65304ae73352b6f6f3.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/29"}]},{"id":70,"title":"Quanto há de Symfony no Drupal 8?","shortDescription":"O PHP evoluiu e junto com ele a maioria dos projetos open-source evoluíram junto com a linguagem, com Drupal não poderia ser diferente. Drupal 8 foi todo reescrito e agora utiliza metade dos componentes que você já utilizava no Symfony, vamos ver como podemos nos beneficiar disso.","description":"O PHP evoluiu e junto com ele a maioria dos projetos open-source evoluíram junto com a linguagem, com Drupal não poderia ser diferente. Drupal 8 foi todo reescrito e agora utiliza metade dos componentes que você já utilizava no Symfony, vamos ver como podemos nos beneficiar disso.<br \/><br \/>Veremos como usar um stack de ferramentas moderno e aderente ao \"Jeito certo\" de programar em PHP.","requirements":"Familiaridade com Symfony","type":"talk","date":"2017-12-07","startTime":"14:30","endTime":"15:30","room":"Sala Ricardo Coelho","speaker":{"id":200,"name":"João Paulo Seregatte Costa","description":"Graduac?a?o Tecnolo?gica em Ana?lise e Desenvolvimento de Sistemas. Te?cnico em Informa?tica - Redes de Comunicac?a?o.<br \/>Profissional com fortes conhecimentos de Drupal, com 6 anos de experie?ncia e palestrante em eventos relacionados a essa ferramenta.<br \/>Utiliza de fortes conhecimentos de infraestrutura e processos de desenvolvimento de software para implementar e melhorar a entrega de valor ao cliente utilizando ferramentas e cultura DevOps.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/085709675286ba0e181780706e1b1121.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/70"}]},{"id":17,"title":"Zend Expressive com OAuth2 e JWT","shortDescription":"Iremos aprender como implementar o protocolo OAuth2 no Zend Expressive, utilizando JSON Web Tokens (JWT) para lidar com os access tokens.<br \/>Falaremo sobre middlewares, controllers, factories e injeção de dependências. Também veremos o que é o OAuth2 e como utilizá-lo na prática.","description":"O Zend Expressive é o micro-framework da Zend que implementa a PSR-7, lançado oficialmente em 2016. A versão 2 foi lançada em março desse ano e tem recebido bastante destaque desde então.<br \/>Nessa palestra, veremos como ele funciona, comentando sobre middlewares, controllers, factories e injeção de dependências via containers.<br \/>Veremos rapidamente sobre OAuth2 e como podemos utilizá-lo para realizar a autorização de APIs no Expressive, usando JSON Web Tokens (JWT) para lidar com access tokens.","requirements":"Programação orientada a objetos","type":"talk","date":"2017-12-07","startTime":"15:30","endTime":"16:30","room":"Sala Elton Minetto","speaker":{"id":123,"name":"Vinícius Campitelli","description":"Desenvolvedor PHP desde os 16 anos, apaixonado por tecnologia e principalmente Web. Responsável pela área de desenvolvimento da @MediaPost - E-mail Marketing e co-fundador do Curseduca, uma startup na área de e-learning.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/a533d090fb6f95f169707e0573800243.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/17"}]},{"id":79,"title":"Doctrine for dummies","shortDescription":"Vamos abordar conceitos fundamentais do contexto de mapeamento objeto relacional, instalação da ferramenta, projetos correlacionados, entidades, operações de CRUD, modelagem de banco de dados, construtor de consultas e expressões, performance e sua relação com frameworks do mercado.","description":"Doctrine e projetos correlacionados.<br \/>Suporte aos mais variados SGBDs, sejam eles relacionais ou NoSQL.<br \/>Abordaremos o DBAL que abstrai dialetos específicos de SQL.<br \/>Falaremos do Entities que é o núcleo do mapeamento objeto relacional.<br \/>Iremos abordar os Repositories, Events e Entity Manager.<br \/>Falaremos das annotations, relacionamentos (1:1, 1:N e N:M), query builder e expression builder, cache, logging, paginação, lifecycle callbacks, SQL filter, cache de segundo nível e inheritance mapping.","requirements":"Desenvolver Orientado à Objetos","type":"talk","date":"2017-12-07","startTime":"15:30","endTime":"16:30","room":"Sala Er Galvão","speaker":{"id":256,"name":"Ari Stopassola Junior","description":"Bacharel em Informática com ênfase em Análise de Sistemas (Unisinos), estudou na Universidade Técnica de Lisboa (Portugal), é Zend Certified Engineer (PHP 5.3), Zend Certified PHP Engineer (PHP 5.5), Rogue Wave Zend Certified Engineer 2017-PHP (PHP 7.1), Zend Framework 2 Certified Architect (ZFCA), Certified ScrumMaster pela Scrum Alliance, Microsoft Certified Professional (MCP), idealizador do curso Certificamp, consultor web e PHP evangelist.<br \/>Atualmente é discente de pós-graduação em Computação Forense & Perícia Digital, mantenedor do site Perito.inf.br e criador do TopTrumPHPs - SuperTrunfo de frameworks PHP.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/91d6ecd92e54cf733b90b5335aaf2c6d.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/79"}]},{"id":93,"title":"Os 4 Pilares de Segurança de uma Aplicação","shortDescription":"Os 4 pilares que formam a base de seguramça de uma aplicação, independente de tecnologia, arquitetura, etc...","description":"Os 4 pilares que formam a base de seguramça de uma aplicação, independente de tecnologia, arquitetura, etc... Nesta palestra veremos 4 técnicas que constituem uma boa base de segurança.","requirements":"Nenhum","type":"talk","date":"2017-12-07","startTime":"15:30","endTime":"16:30","room":"Sala Flavio Lisboa","speaker":{"id":78,"name":"Er Galvão Abbott","description":"Presidente da ABRAPHP – Associação Brasileira de Profissionais PHP<br \/>Diretor da PHP Conference Brasil<br \/>Contribui para a tradução da documentação oficial <br \/>Atua como Zend Framework Evangelist para o ZTeam, da Zend.<br \/>Professor (Especialista) de Pós-Graduação <br \/>    UNOESC (SC) e<br \/>    Faculdade Alfa (PR)<br \/><br \/>20+ anos desenvolvendo sistemas e aplicações com interface web<br \/>    15+ destes com PHP<br \/>     7+ com Zend Framework<br \/><br \/>Palestrante em eventos nacionais e internacionais<br \/>Instrutor de cursos presenciais e a distância<br \/>Fundador e líder do GU PHPBR<br \/>Fundador* e membro do GU PHPRS","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/f2448027dd1cbb6e1a186169f1c41c5c.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/93"}]},{"id":55,"title":"Laravel Collections: 6 formas de melhorar seu código com Collections","shortDescription":"As Collections do Laravel, disponíveis via pacote `illuminate\/collections`, preenchem uma lacuna no PHP ao trazer uma ferramenta poderosa de representar, traversar e processar coleções de dados. Veja como aplicar patterns como map, reduce, filter e where para simplificar e melhorar seu código.","description":"As Collections do Laravel, disponíveis para qualquer aplicação através do pacote `illuminate\/collections`, preenchem uma lacuna no PHP ao trazer uma ferramenta poderosa de representar, traversar e processar coleções de dados. Veja como aplicar patterns como map, reduce, filter e where para simplificar e melhorar seu código.","requirements":"experiência intermediária com PHP e composer","type":"talk","date":"2017-12-07","startTime":"15:30","endTime":"16:30","room":"Sala Flavio Lisboa","speaker":{"id":121,"name":"Aryel Tupinambá","description":"Co-fundador e CTO da LQDI Digital, dirige e desenvolve projetos para empresas como Porto Seguro, Nestlé, Edenred \/ Ticket, Terra Networks, Grupo Whirlpool, Tishman-Speyer e Editora Abril. Engenheiro da Computação pela FIAP\/SU, trabalha com PHP e desenvolvimento web há mais de 12 anos, desde os primórdios do PHP e da era ponto-com.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/8c794e547023a2a38229323fbe40c8b0.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/55"}]},{"id":89,"title":"Graphql com PHP","shortDescription":"Tem bastante gente usando (http:\/\/graphql.org\/users\/), como por exemplo o github (https:\/\/developer.github.com\/v4\/) então gostaria falar o que é quem usa e mostrar como usar com PHP utilizando as ferramentas: https:\/\/github.com\/webonyx\/graphql-php https:\/\/github.com\/ivome\/graphql-relay-php","description":"Tem bastante gente usando (http:\/\/graphql.org\/users\/), como por exemplo o github (https:\/\/developer.github.com\/v4\/) então gostaria falar o que é quem usa e mostrar como usar com PHP utilizando as ferramentas: https:\/\/github.com\/webonyx\/graphql-php https:\/\/github.com\/ivome\/graphql-relay-php","requirements":"Nenhum","type":"talk","date":"2017-12-07","startTime":"15:30","endTime":"16:30","room":"Sala Ricardo Coelho","speaker":{"id":274,"name":"Diego Henrique Sousa Saouda","description":"Bacharel em Ciência da Computação pela Universidade de Guarulhos, atua na área de Engenharia de Software utilizando Java, NodeJS e princialmente PHP. Fã de Docker e micro frameworks como silex e expressive. Nós últimos anos tem trabalhado com WEB Crawlers, normalizando as informações capturadas e expondo uma API para consumo dessas informações. ","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/63fc79abf3ba31e4bbd97fbd2eb1abaa.png","0":"png"},"links":[{"rel":"self","uri":"\/talks\/89"}]},{"id":25,"title":"Seja subversivo, faça testes","shortDescription":"Quem nunca trabalhou em uma empresa que diz que testes automatizados, seja BDD ou TDD só atrasam o tempo de desenvolvimento de uma tarefa e não servem para nada? Ou, quem nunca trabalhou em uma empresa que não sabe o que é automatização de testes? Se este é o seu caso, descubra alguns segredos que i","description":"Apresentarei a importância de se trabalhar com testes e como fazer isso mesmo em uma equipe ou empresa que seja contrária a testes.","requirements":"Vontade de aprender e preocupação de alguma forma com qualidade de software","type":"talk","date":"2017-12-07","startTime":"17:00","endTime":"18:00","room":"Sala Er Galvão","speaker":{"id":217,"name":"Vitor Mattos","description":"Iniciei meus estudos na área de desenvolvimento web em 2000 como autodidata com CGI\/PERL e PHP. Trabalho há mais de 10 anos profissionalmente na área de web e TI, empreendedor, sempre buscando novos desafios e conhecimentos. Grande incentivador do software livre, palestrante em eventos regionais e nacionais. Amante do conhecimento e apaixonado por compartilhá-lo com todos.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/76607ae8adc0ae3e11345b2562b5a7f7.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/25"}]},{"id":67,"title":"Implementando autenticação de dois fatores em qualquer aplicação","shortDescription":"Todos temos conhecidos cujas senhas foram expostas. Conhece alguém?<br \/>São frequentes os relatos de invasão de servidores, uso de engenharia social, vazamentos de senhas por hackers ou descuido com a proteção das senhas.<br \/>Veremos como nos proteger usando autenticação de dois fatores em nossos sistemas.","description":"Sabemos que a autenticação de dois fatores é uma grande aliada dos nossos usuários, mas mostraremos porque os maiores beneficiados são o desenvolvedor e a empresa que detém o software.<br \/>Mais do que isto, veremos como implementar a autenticação de dois fatores em um sistema Web utilizando PHP.<br \/>Nossa solução poderá ser usada com qualquer autenticador de uso comum, como Google Authenticator, Authy e similares, bem como em uma implementação de cliente próprio, se você preferir.","requirements":"Nenhum","type":"talk","date":"2017-12-07","startTime":"17:00","endTime":"18:00","room":"Sala Flavio Lisboa","speaker":{"id":218,"name":"Ricardo Coelho","description":"RICARDO COELHO é cientista da computação pela Universidade Federal do Maranhão - UFMA, concentrando interesse em aplicações web com ênfase em webservices. Fundador do grupo PHP-Maranhão, que desde 2005 congrega mais de 700 profissionais do estado. Com mais de 20 anos de experiência profissional em desenvolvimento e docência, representa o Maranhão como palestrante em eventos no Brasil e no exterior. É vice-presidente da Associação Brasileira de Profissionais PHP - ABRAPHP, onde atua pela integração da tríade governo-mercado-academia. É especialista em em sistemas de segurança da informação, auditor certificado NBR ISO\/IEC 27001 e perito forense digital.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/faf282c22f891d6b1aa641da7afc28df.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/67"}]},{"id":61,"title":"Drupal para não drupaleiros","shortDescription":"Um overview de o que o Drupal pode fazer por você. Ele é mais um dos CMSs PHP e possui um lugar próprio.<br \/>Desde segurança, escalabilidade, até velocidade de desenvolvimento e onde e quando usar. <br \/>Veremos módulos, estruturas de conteúdos, papéis, quando e onde codar, pontos fortes e fracos. <br \/><br \/>","description":"Um overview de o que o Drupal pode fazer por você. Ele é mais um dos CMSs PHP e possui um lugar próprio.<br \/>Desde segurança, escalabilidade, até velocidade de desenvolvimento e onde e quando usar. <br \/>Veremos módulos, estruturas de conteúdos, papéis, quando e onde codar, pontos fortes e fracos. <br \/><br \/>","requirements":"Nenhum","type":"talk","date":"2017-12-07","startTime":"17:00","endTime":"18:00","room":"Sala Ricardo Coelho","speaker":{"id":335,"name":"Marcelo Soares","description":"Web Developer desde 2010, passou pela Mitra Web, Base Digital e atualmente trabalha na empresa MMDA, desenvolvendo para empresas como Souza Cruz, Sebrae, Visão Mundial e Vipal, entre outras. Associado e membro do conselho atual da Associação Drupal.org, utiliza principalmente este framework desde 2012, quando também se tornou divulgador e entusiasta do Drupal no Brasil, participando de mesas e debates sobre o tema.  Drupal e Software Livre, como no FISL (Fórum Internacional de Software Livre), DrupalCampSP, DrupalDayPoa, entre outros. Técnico em Biotecnologia, frequentou a academia nos cursos de Jogos Digitais e Ciência da Computação. Atualmente, é graduando em Ciência Sociais pela Universid","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/604453e9922c59f5d8d0064b6539f8e9.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/61"}]},{"id":49,"title":"Desconstruindo o PHP Conference Mobile App","shortDescription":"Nesta palestra vamos ver cada detalhe do App Mobile da PHP Conference 2017. Vamos falar das tecnologias utilizadas, as ferramentas e envolvidas e um pouco do processo de como foi o desenvolvimento. <br \/><br \/>Com um espaço para surpresa no final. :)","description":"Vamos ver como foram utilizadas as ferramentas e falar sobre boas práticas utilizadas. <br \/><br \/>A ideia desta talk é realmente \"desconstruir\" o App e falar sobre o Ionic, que foi utilizado no desenvolvimento do app; <br \/>Falar dos recursos que conseguimos disponibilizar;<br \/>Falar sobre o desenvolvimento da API;<br \/><br \/>A ideia é compartilhar o processo de desenvolvimento da Aplicação mobile e da API, mostrando o quão simples é criar uma API Rest e integrar ao Ionic Framework. <br \/>","requirements":"nenhum","type":"talk","date":"2017-12-08","startTime":"09:30","endTime":"10:30","room":"Anfiteatro Guilherme Blanco","speaker":{"id":212,"name":"Jefferson Souza","description":"Programador PHP a 7 anos, participante da comunidade Carioca de desenvolvedores PHP. Gosto de estar por dentro de novas tecnologias e de soluções que agilizem o desenvolvimento e otimize a performance.  Tenho trabalhado com desenvolvimento mobile paralelamente à mais de 2 anos e tenho tido ótimas experiências com o mundo mobile. ","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/b496c72d47b552104047ebe10c6cb571.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/49"}]},{"id":7,"title":"Microsserviços: Distribuindo serviços críticos ao negócio","shortDescription":"Nesta apresentação será abortado conceitos como arquitetura orientada a serviço, arquitetura de microsserviços, escalabilidade, componentização, descentralização, resiliência, monitoramento, entre outros assuntos voltados para o desenvolvimento de aplicações que permitem se pensar em componentes ou ","description":"Nesta apresentação será abortado conceitos como arquitetura orientada a serviço, arquitetura de microsserviços, escalabilidade, componentização, descentralização, resiliência, monitoramento, entre outros assuntos voltados para o desenvolvimento de aplicações que permitem se pensar em componentes ou camadas independentes que podem ser implantadas, distribuídas, protegidas ou escaladas de forma também independente.  <br \/>Estes conceitos serão exemplificados através de um case onde foi desenvolvido um ","requirements":"datashow","type":"talk","date":"2017-12-08","startTime":"11:00","endTime":"12:00","room":"Anfiteatro Guilherme Blanco","speaker":{"id":311,"name":"Fernando Silva","description":"Analista de Desenvolvimento na KingHost, graduado em Análise e Desenvolvimento de Sistemas (ADS) pela Faculdade Senac Porto Alegre, onde ganhou o Prêmio Keller de melhor trajetória acadêmica. Atualmente faz pós-graduação em Segurança Cibernética pela UFRGS, além disso, é um dos coordenadores da comunidade PHP-RS, é entusiasta Open Source e Software Livre.<br \/>","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/0db2cd86c2c9df622c285505d0ba4262.JPG","0":"JPG"},"links":[{"rel":"self","uri":"\/talks\/7"}]},{"id":46,"title":"Modernizando projetos legados usando APIs","shortDescription":"Projetos legados podem ser um desafio para manter e modernizar. Nesta apresentação vou falar sobre casos reais de nossos clientes.","description":"Nesta palestra vou mostrar os desafios para modernizar um projeto usando conceitos como API Gateway, Webhooks e eventos. Vou apresentar o caso de sucesso de um de nossos clientes e como resolvemos estes e outros desafios usando Zend Expressive 2, containers e testes automatizados.","requirements":"PHP, API","type":"talk","date":"2017-12-08","startTime":"11:00","endTime":"12:00","room":"Anfiteatro Rafael Dohms","speaker":{"id":207,"name":"Elton Minetto","description":"Elton  Minetto possui graduação em Ciência de Computação pela Unochapecó e especialização em Ciência da Computação pela UFSC\/UNOESC.  É autor do livro Frameworks para Desenvolvimento em PHP, da editora Novatec, co-autor do livro Grid Computing in Research and Education, publicado pela editora IBM\/Redbooks, EUA e autor dos e-books Zend Framework na prática, Zend Framework 2 na prática, Iniciando com o Zend Framework 2 e Doctrine na Prática.<br \/>É co-fundador da Coderockr e Zend Framework Evangelist","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/b27cdfb83e1d98bf8f2df259ac8e1793.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/46"}]},{"id":91,"title":"Code decoupling from Symfony (and others frameworks)","shortDescription":"Frameworks are very helpful to solve common problems when developing an application.<br \/>But what happens when we have to move to another framework?  In this talk I will show how my company tries to keep independent of any framework, decoupling our business logic from symfony.","description":"Frameworks are very helpful to solve common problems when developing an application.<br \/>But what happens when we have to move to another framework?  In this talk I will show how my company tries to keep independent of any framework, decoupling our business logic from symfony.","requirements":"php, symfony","type":"talk","date":"2017-12-08","startTime":"13:30","endTime":"14:30","room":"Sala Elton Minetto","speaker":{"id":282,"name":"Miguel Gallardo","description":"Software Engineer with more than 13 years of experience on Development end to end of Applications. Always learning to improve my skill, I have become a polyglot Programmer who works on multiple programming languages and development's paradigms","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/b4aa81adc7a1c92c5bdd826a9e600f53.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/91"}]},{"id":81,"title":"WooCommerce - Lojas Virtuais de gente grande. ","shortDescription":"Entenda como o WooCommerce pode atender um GRANDE volume de vendas.<br \/>","description":"- O que é WooCommerce?<br \/>- O que o WooCommerce oferece?<br \/>- Estrutura de temas e módulos.<br \/>- Infraestrutura.<br \/>- Grandes lojas virtuais que usam o WooCommmece.<br \/>- Case","requirements":"Conhecimentos em PHP e MySQL","type":"talk","date":"2017-12-08","startTime":"13:30","endTime":"14:30","room":"Sala Er Galvão","speaker":{"id":232,"name":"Edison Pereira da Costa","description":"CTO da AgiusCloud. Professor e programador com 32 anos de experiência em TI.<br \/>Iniciou sua carreira com a Linguagem COBOL <br \/>e hoje dedica a maior parte de seu tempo em otimizar servidores Linux,<br \/>mesmo programando ativamente em PHP.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/af7656985cb14b8a95f7b31b20cbcad6.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/81"}]},{"id":52,"title":"Graph API - Desenvolvimento para Facebook","shortDescription":"Apresentar as características da API do Facebook, como funciona, quais os recursos disponíveis, ferramentas de apoio ao desenvolvedor, componente de Login, sugestões e idéias de aplicativos que podem ser desenvolvidos. Exemplos de interações com a API usando o SDK para PHP. ","description":"Durante a palestra pretendo discutir os seguintes pontos referente a Graph API:<br \/><br \/>- Componente de Login, Autenticação e Tokens de Acesso<br \/>- Permissões<br \/>- Integrações<br \/>- Publicações e consultas<br \/>- Fazendo buscas<br \/>- Requisições batch<br \/>- Funções depreciadas","requirements":"Noções de APIs REST, OAuth, Protocolo HTTP","type":"talk","date":"2017-12-08","startTime":"13:30","endTime":"14:30","room":"Sala Flavio Lisboa","speaker":{"id":139,"name":"DOUGLAS VILLANACCI PASQUA","description":"Douglas V. Pasqua atua na área de Engenharia de Software, especialista nas linguagens PHP e Java e na área de Infraestrutura e Segurança da Informação, especialista em soluções baseadas em Linux. Trabalha no mercado de TI profissionalmente desde 2002. Possui as certificações: Zend Certified Engineer, Sun Certified Java Programmer, LPIC-1 e LPIC-2. Atua como instrutor e palestrante em assuntos relacionados com software livre. Escreve, esporadicamente, sobre assuntos técnicos no blog http:\/\/douglaspasqua.com","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/dc4cb3750c7674dfb6c257ca6c1d405e.png","0":"png"},"links":[{"rel":"self","uri":"\/talks\/52"}]},{"id":19,"title":"Git avançado para desenvolvedores","shortDescription":"<br \/>Git é uma ferramenta fantástica mas a maioria dos desenvolvedores só<br \/>conhecem os comandos básicos.<br \/><br \/>Nessa palestra vou te mostrar como o Git funciona por dentro e te apresentar alguns comandos secretos que vão fazer sua produtividade ir as alturas.<br \/><br \/>","description":"<br \/>Alguns dos tópicos que abordarei:<br \/><br \/>- Patches e como eles podem mudar como você trafega código<br \/>- Buscar no histórico e recuperar qualquer coisa como um rei<br \/>- Reescrever tudo, sem medo<br \/>- Por baixo dos panos, como o git funciona?<br \/>","requirements":"Saber programar, Saber usar controle de versão, Saber usar o terminal","type":"talk","date":"2017-12-08","startTime":"13:30","endTime":"14:30","room":"Sala Ricardo Coelho","speaker":{"id":191,"name":"Jean Carlo Machado","description":"My name is Jean Carlo Machado. I'm a 22 years old, professional Backend developer at Compufour. I studied Análise e Desenvolvimento de Sistemas at IFRS-BG.<br \/><br \/>I'm in love with science and technology in general. I really appreciate Open Source and the Unix Way. I know several programming languages but I do reserve special interest for PHP, C and Bash script. My hobbies include: boggling, to play violin, reading and programming; sporadically some electronics stuff or painting. But maybe the thing I do the most is to look for ways to improve my development process.<br \/>","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/5a21880b8cc2d120e3a084f89549425e.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/19"}]},{"id":31,"title":"Desenvolvimento de uma Infraestrutura Ágil com Práticas DevOps ","shortDescription":"Essa palestra irá abordar como desenvolver uma InfraÁgil, permitindo homologar, testar e colocar em produção softwares se integrando com a área de desenvolvimento e tendo como resultado um Delivey Contínuo. ","description":"Para que o DevOps realmente funcione em uma organização, precisamos falar de como gerenciar uma infraestrutura como se fosse o desenvolvimento de softwares. Com o surgimento de ferramentas como Docker, OpenStack, Puppet, Ansible, Git e Jenkins já é possível tornar sua Infraestrutura Ágil.<br \/><br \/>Essa palestra irá abordar como desenvolver uma InfraÁgil, permitindo homologar, testar e colocar em produção softwares se integrando com a área de desenvolvimento e tendo como resultado um Delivey Contínuo. ","requirements":"Trabalhar na área de desenvolvimento ou operações.","type":"talk","date":"2017-12-08","startTime":"14:30","endTime":"15:30","room":"Sala Elton Minetto","speaker":{"id":140,"name":"Gabriela Dias","description":"Com mais de 15 anos de experiência em projetos FOSS (Free and Open Source Software) atualmente é IT Team Leader na empresa 4Linux, sendo responsável pelas áreas de infraestrutura e treinamento, como também atuando em projetos de missão crítica. Adepta a Filosofia DevOps vem trabalhando no conceito de Infraestrutura Ágil para união desses dois mundos. Atuou como Engenheira de Projetos na HP-Brasil desenhando soluções na plataforma Linux\/Unix. Possui as certificações RHCE, RHCSA, LPIs, Zabbix Certified.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/865e3c3535086d9e5557df2f38c2d3be.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/31"}]},{"id":84,"title":"Aplicações em PHP 10x a 100x mais rápida com o PostgreSQL","shortDescription":"Os elefantes do PostgreSQL e do PHP já são amigos há muito tempo. Mas essa amizade funciona muito melhor quando alguns cuidados básicos são tomados. Aqui vamos mostrar como tornar a sua aplicação mais rápida e eficiente no uso do banco de dados.","description":"Conexões e pool de conexões; Logs e auditoria; Mantendo a casa limpa, sempre! Usando índices do jeito certo; Evitando laços desnecessários; PL\/o_que_voce_quiser; SQLs ninjas com Window Functions.","requirements":"Conhecer a linguagem SQL","type":"talk","date":"2017-12-08","startTime":"14:30","endTime":"15:30","room":"Sala Er Galvão","speaker":{"id":340,"name":"Fábio Telles Rodriguez","description":"DBA Oracle e PostgreSQL há mais de 15 anos. Grande experiência com ambientes críticos, grande porte, desenvolvimento, segurança e performance em banco de dados. Já palestrou em dezenas de eventos em todo o Brasil e publicou centenas de artigos sobre banco de dados em seu blog que mantém há mais de 10 anos. Já participou do Comitê para Democratização da Informática (CDI-SP) , Projeto de Software Livre do ABCD (PLS-ABCD) e da comunidade de PostgreSQL do Brasil (PGBR) onde atua até hoje. Apreciador de boas cervejas e adora peladar em cada nova cidade que conhece.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/fe698e313796a5b07de2717a819dc9d4.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/84"}]},{"id":76,"title":"Dicas para realização de teste prático em processos seletivos.","shortDescription":"Saiba com o que você deve se preocupar quando for realizar um teste prático em PHP.<br \/>Nessa palestra trarei dicas e boas práticas que podem te ajudar a ter um bom resultado em um teste prático.<br \/>","description":"Com o intuito de conhecer melhor o nível técnico dos candidatos, muitas empresas aplicam testes práticos durante o processo seletivo. Neste palestra, apresentarei alguns pontos que os candidatos devem se atentar ao realizar um teste.<br \/>","requirements":"Conhecimentos básicos em PHP.","type":"talk","date":"2017-12-08","startTime":"14:30","endTime":"15:30","room":"Sala Flavio Lisboa","speaker":{"id":343,"name":"Vitor Bari Buccianti","description":"Desenvolvedor PHP desde 2008, certificado ZCPE, graduado em Engenharia de Computação.<br \/>Trabalhando atualmente como Desenvolvedor Back-End na Leroy Merlin.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/51ad5e76ea202dc1dafba80f4975770e.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/76"}]},{"id":77,"title":"Tmux + VIM para PHP","shortDescription":"Com atalhos simples e algumas configurações podemos ter um ambiente poderoso e versátil utilizando VIM + Tmux para desenvolver com PHP","description":"Veremos algumas configurações do VIM e do Tmux para melhorar o fluxo de trabalho no desenvolvimento de PHP, bem como plugins para o auxilio de melhores códigos.","requirements":"Conhecimentos básicos em Linux e PHP","type":"talk","date":"2017-12-08","startTime":"14:30","endTime":"15:30","room":"Sala Ricardo Coelho","speaker":{"id":323,"name":"Vanildo Souto Mangueira","description":"Analista programador, gamer, entusiasta Linux e curioso, muito curioso","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/8e17e0681bad248b8ac94dcd8f34e306.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/77"}]},{"id":85,"title":"MySQL como Document Store","shortDescription":"Conheça uma nova forma schemaless de usar o MySQL e ganhe produtividade e flexibilidade ao trabalhar diretamente com documentos JSON, chave-valor ou híbrido NoSQL e SQL.","description":"O MySQL agora pode ser usado como um NoSQL document store, combinando a flexibilidade do modelo de armazenamento de documentos com o poder do modelo relacional. A partir da versão 5.7 foram adicionados tipo de dados nativo JSON, colunas virtuais com indexação e muitas novas funções para manipulação de JSON. Mas agora há também um novo protocolo e API para tornar a vida do desenvolvedor ainda mais fácil. Com estas novidades o arquiteto deixará de ser forçado a escolher entre muitos trade-offs importantes quando estiver selecionando soluções NoSQL ou SQL. Nesta palestra daremos uma visão geral das novidades com alguns exemplos e casos de uso.","requirements":"Nenhum","type":"talk","date":"2017-12-08","startTime":"16:00","endTime":"17:00","room":"Sala Elton Minetto","speaker":{"id":330,"name":"Airton Lastori","description":"Airton Lastori é consultor MySQL da Oracle Brasil. Possui formação em Ciência da Computação pela Universidade Federal de Itajubá e é mestrando no ITA. Há mais de 10 anos está envolvido com diversas tecnologias Open Source relacionadas principalmente ao universo Web.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/253b41b5d424546c42945924160b53eb.jpeg","0":"jpeg"},"links":[{"rel":"self","uri":"\/talks\/85"}]},{"id":93,"title":"Os 4 Pilares de Segurança de uma Aplicação","shortDescription":"Os 4 pilares que formam a base de seguramça de uma aplicação, independente de tecnologia, arquitetura, etc...","description":"Os 4 pilares que formam a base de seguramça de uma aplicação, independente de tecnologia, arquitetura, etc... Nesta palestra veremos 4 técnicas que constituem uma boa base de segurança.","requirements":"Nenhum","type":"talk","date":"2017-12-08","startTime":"16:00","endTime":"17:00","room":"Sala Er Galvão","speaker":{"id":78,"name":"Er Galvão Abbott","description":"Presidente da ABRAPHP – Associação Brasileira de Profissionais PHP<br \/>Diretor da PHP Conference Brasil<br \/>Contribui para a tradução da documentação oficial <br \/>Atua como Zend Framework Evangelist para o ZTeam, da Zend.<br \/>Professor (Especialista) de Pós-Graduação <br \/>    UNOESC (SC) e<br \/>    Faculdade Alfa (PR)<br \/><br \/>20+ anos desenvolvendo sistemas e aplicações com interface web<br \/>    15+ destes com PHP<br \/>     7+ com Zend Framework<br \/><br \/>Palestrante em eventos nacionais e internacionais<br \/>Instrutor de cursos presenciais e a distância<br \/>Fundador e líder do GU PHPBR<br \/>Fundador* e membro do GU PHPRS","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/f2448027dd1cbb6e1a186169f1c41c5c.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/93"}]},{"id":82,"title":"Essential Tools for PHP Architects","shortDescription":"O PHP cresceu e se tornou popular graças à sua baixa barreira de entrada e qualquer um com uma simples stack LAMP pode começar à desenvolver em algumas horas, mas para sair do Hello World até uma aplicação escalável e production-ready, precisamos escolher e utilizar as ferramentas certas.","description":"Nessa talk, vou abordar e enfatizar o uso de ferramentas essenciais que todo arquiteto e engenheiro PHP precisa dominar para levar suas aplicações à um nível enterprise de maneira eficiente e escalável. Ferramentas como Application Frameworks (full vs micro), Test Frameworks, geradores de documentação, controle de versão e muito mais!","requirements":"PHP (todos os níveis), *nix OS","type":"talk","date":"2017-12-08","startTime":"16:00","endTime":"17:00","room":"Sala Flavio Lisboa","speaker":{"id":151,"name":"Lucas Mendes","description":"Desenvolvedor desde a era do Microsoft FrontPage, atualmente trabalha como Software Architect na Nuvem Shop (Tienda Nube), responsável pela definição, implantação e manutenção de uma complexa arquitetura de micro-serviços. Aspirante à Cientista da Computação pela PUC Minas, evangelista PHPMG, palestrante e contribuidor em diversos projetos Open Source tendo como foco tecnologias e ferramentas voltadas para web e aplicações modernas. Nas horas livres gosta de escrever rascunhos de artigos para seu blog pessoal, aprender uma linguagem nova e incomodar os vizinhos ouvindo Rock N Roll.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/40eb90fd95ac28c531a4da31132ed2d8.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/82"}]},{"id":87,"title":"Elasticsearch com PHP","shortDescription":"Utilizando php e java script, vamos mostrar uma implementação passo a passo de como tratar e compilar uma grande quantidade de dados em tempo real.","description":"Utilizando php e java script, vamos mostrar uma implementação passo a passo de como tratar e compilar uma grande quantidade de dados em tempo real. Como exemplo utilizaremos alguns dados extraídos do  PORTAL BRASILEIRO DE DADOS ABERTOS ( http:\/\/dados.gov.br\/ ) e compilando eles para obter buscas com alto desempenho.","requirements":"JavaScript (Intermediario); PHP (Intermediario); Apache (Basico); Unix (Basico)","type":"talk","date":"2017-12-08","startTime":"16:00","endTime":"17:00","room":"Sala Ricardo Coelho","speaker":{"id":286,"name":"Richard Brochini","description":"Richard Brochini, 30 anos.<br \/>Atua na área de desenvolvimento de sistema há 11 anos.<br \/>Atualmente trabalha como Head Developer na empresa Dilemma, ajudando a construir soluções que tornem coisas chatas e complicadas em simples e tem sua própria empresa de desenvolvimento de games web e mobile <br \/>Apoia projetos que acredita que possa fazer diferença no mundo, como AISEC e ABRAWEB, sempre em busca de desenvolvimento pessoal e saber onde pode melhorar.<br \/><br \/>Para saber mais:<br \/>https:\/\/www.linkedin.com\/in\/richardbrochini","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/98ca5c18352dbf1a888dcccc2e93880e.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/87"}]},{"id":45,"title":"VPS sem Segredos - Da Escolha ao Deploy","shortDescription":"Entenda os benefícios de executar sua aplicação em um Servidor Virtual Privado (VPS) e como é possível configurá-lo em menos de 5 minutos.","description":"- Hospedagem web: da Compartilhada ao VPS. <br \/>- Por quê migrar.<br \/>- Quais as opções de VPSs.<br \/>- Ferramentas necessárias.<br \/>- Configurando um servidor otimizado do Zero em 5 minutos.","requirements":"Nenhum","type":"talk","date":"2017-12-08","startTime":"17:00","endTime":"18:00","room":"Sala Elton Minetto","speaker":{"id":232,"name":"Edison Pereira da Costa","description":"CTO da AgiusCloud. Professor e programador com 32 anos de experiência em TI.<br \/>Iniciou sua carreira com a Linguagem COBOL <br \/>e hoje dedica a maior parte de seu tempo em otimizar servidores Linux,<br \/>mesmo programando ativamente em PHP.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/af7656985cb14b8a95f7b31b20cbcad6.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/45"}]},{"id":26,"title":"PHPUnit com TDD","shortDescription":"Essa palestra tem como foco mostrar a importância da metodologia TDD, auxiliando na arquitetura, desenvolvimento e codificação legível\/instável.<br \/>Será abordado conceitos de TDD (Test-driven development) utilizando o PHPUnit, conceitos de orientação a objetos e o uso de testes usando CI.","description":"- O que é TDD<br \/>- O que é PHPUnit e teste de unidade<br \/>- Configuração inicial do phpunit.xml<br \/>- Escrevendo o primeiro teste (init)<br \/>- Conotações de testes usando @<br \/>- Principais tipos de asserts<br \/>- O método setUp() e sua importância<br \/>- Gerando um provedor de dados (data provider)<br \/>- Testando exceptions com PHPUnit<br \/>- Mocking com PHPUnit<br \/>- Gerando o code coverage","requirements":"PHP orientado à objetos","type":"talk","date":"2017-12-08","startTime":"17:00","endTime":"18:00","room":"Sala Er Galvão","speaker":{"id":320,"name":"Layo Demetrio","description":"Analista de sistemas sênior na locaweb, paulista 28 anos. Adora tecnologia programa em linguagens tais como: PHP, Ruby, python e Java. <br \/>Com 10 anos de experiência também gosta de estudar assuntos sobre segurança da informação.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/9e9879625fad0737edda8211f2bd5ca9.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/26"}]},{"id":27,"title":"Relatórios de alto nível com PHP","shortDescription":"Se você já teve dores de cabeça para gerar algum relatório, seja em pdf, planilha ou qualquer outro formato, participe desta palestra para chorar suas mágoas e aprender a usar uma mega ferramenta de relatórios em PHP que irá te deixar de queixo caído com a facilidade e agilidade para gerar relatório","description":"Apresentarei as dores que é gerar relatórios em php e uma solução para estas dores com uma ferramenta visual para criação de relatórios. A palestra é para todos porém o conhecimento básico já dará uma grande ajuda. Caso não tenha estes conhecimentos, dê pelo menos uma lida sobre o que é git e composer antes de assistir esta talk.","requirements":"php","type":"talk","date":"2017-12-08","startTime":"17:00","endTime":"18:00","room":"Sala Flavio Lisboa","speaker":{"id":217,"name":"Vitor Mattos","description":"Iniciei meus estudos na área de desenvolvimento web em 2000 como autodidata com CGI\/PERL e PHP. Trabalho há mais de 10 anos profissionalmente na área de web e TI, empreendedor, sempre buscando novos desafios e conhecimentos. Grande incentivador do software livre, palestrante em eventos regionais e nacionais. Amante do conhecimento e apaixonado por compartilhá-lo com todos.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/76607ae8adc0ae3e11345b2562b5a7f7.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/27"}]},{"id":64,"title":"O Uso de Latex para Imprimíveis em Sistemas de Informação","shortDescription":"Relatamos como é possível utilizar o LaTeX para a geração de imprimíveis de altíssima qualidade em systemas de informaçaão.","description":"Relatamos como é possível utilizar o LaTeX para a geração de imprimíveis de altíssima qualidade em systemas de informaçaão.","requirements":"datashow","type":"talk","date":"2017-12-08","startTime":"17:00","endTime":"18:00","room":"Sala Ricardo Coelho","speaker":{"id":339,"name":"Ole Peter Smith","description":"Professor Associado, IME\/UFG. Ms em Engenharia (1990) e PhD em Matemática (1996). Programador desde 1990, Sysadmin 1996-2009. ","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/3d25ab50976888735535f70b40d224ce.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/64"}]},{"id":90,"title":"WordPress Code Security","shortDescription":"We will go over some of the most common attack vectors in code and how to protect against them while you write or edit a theme or plugin.","description":"We will go over some of the most common attack vectors in code and how to protect against them while you write or edit a theme or plugin. This will include: Escaping in WordPress; SQL and Data sanitization; Permissions with current_user_can(); Using Nonces to protect against CSRF; WordPress and PHP Security Gotchas.","requirements":"None","type":"talk","date":"2017-12-09","startTime":"09:00","endTime":"10:00","room":"Anfiteatro Guilherme Blanco","speaker":{"id":347,"name":"Henrique Mouta","description":"Programador PHP desde 2009, trabalha actualmente para a Automattic, no WordPress.com VIP, onde lida diariamente com sites de grande volume de tráfego como o Time.com, Abril, TED, Facebook, entre outros. Praticamente a terminar o curso de Engenharia Informática e de Computadores, do Instituto Superior Técnico em Lisboa, tem como especialidade WordPress e optimização e segurança desta plataforma.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/49e0e7b4ff7506751a26f61acb39d8fe.png","0":"png"},"links":[{"rel":"self","uri":"\/talks\/90"}]},{"id":30,"title":"ReactPHP e PHP assincrono","shortDescription":"Durante muito tempo programamos PHP de uma maneira. Novos paradigmas entram em cena como processamento paralelo e requisicoes assincronas nao bloqueantes.<br \/>Conheca entao a programacao reativa PHP.","description":"Definicoes e teoria<br \/>React PHP , Ratchet, Event Loop, IO bloqueante<br \/>Como era (ajax) - $.ajax( .....<br \/>Como pode ser feito : conheca sockets <br \/>","requirements":"php sockets","type":"talk","date":"2017-12-09","startTime":"10:30","endTime":"11:30","room":"Anfiteatro Guilherme Blanco","speaker":{"id":290,"name":"L Gustavo Almeida","description":"Zend Certified Engineer<br \/>LPI nivel 1 e 2<br \/>Atualmente faco mestrado na PUC-RJ<br \/>Instrutor Impacta<br \/>FreeLancer","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/de47a1a8696c0d65304ae73352b6f6f3.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/30"}]},{"id":68,"title":"Alexa... diga olá ao Drupal","shortDescription":"Alexa é um grande serviço de comandos por voz, criado pela Amazon e capaz de realizar e responder a muitas tarefas. Com Drupal 8, cada vez mais orientado a serviço e API first, mostraremos como integrar Alexa e Drupal para serviços de inteligência e novas possibilidades de implantação.","description":"Alexa é um grande serviço de comandos por voz, criado pela Amazon e capaz de realizar e responder a muitas tarefas. Com Drupal 8, cada vez mais orientado a serviço e API first, mostraremos como integrar Alexa e Drupal para serviços de inteligência e novas possibilidades de implantação.<br \/><br \/>Nessa palestra vamos apresentar do Drupal 8, Alexa e sua API além de mostrar como que com essa ferramenta podemos focar mais no negócio e com pouco de esforço, conseguir grandes resultados.","requirements":"Protocolo HTTP","type":"talk","date":"2017-12-09","startTime":"10:30","endTime":"11:30","room":"Anfiteatro Rafael Dohms","speaker":{"id":200,"name":"João Paulo Seregatte Costa","description":"Graduac?a?o Tecnolo?gica em Ana?lise e Desenvolvimento de Sistemas. Te?cnico em Informa?tica - Redes de Comunicac?a?o.<br \/>Profissional com fortes conhecimentos de Drupal, com 6 anos de experie?ncia e palestrante em eventos relacionados a essa ferramenta.<br \/>Utiliza de fortes conhecimentos de infraestrutura e processos de desenvolvimento de software para implementar e melhorar a entrega de valor ao cliente utilizando ferramentas e cultura DevOps.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/085709675286ba0e181780706e1b1121.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/68"}]},{"id":39,"title":"Scrum Um Pattern para Hiperprodutividade","shortDescription":"A ideia desta palestra, será propagar o Manifesto Ágil, focado no Scrum, e entender como a melhor forma de aplicar, e extrair o melhor do seu time. Sempre focado nos patters de sucessos PLOP. Mais voltado para gerenciamento, contará com embasamento teórico, e cases de sucesso. ","description":"Nesta palestra entenderemos o Scrum, suas cerimônias, e por que extrair o feedback rápido, facilita o desenvolvimento. Entenderemos que o Scrum não é apenas meia dúzia de cerimônias e sim uma forma de gerenciar, que foca em três pilares de controle de processo empírico: transparência, inspeção e adaptação e nos valores de comprometimento, coragem, foco, transparência e respeito.","requirements":"Nenhum","type":"talk","date":"2017-12-09","startTime":"11:30","endTime":"12:30","room":"Sala Elton Minetto","speaker":{"id":124,"name":"Lucien Carbonare Jospin","description":"Ampla vivência em internet, e sistemas, tanto na área de desenvolvimento como na área de análise. Vivência empreendedora, e perfil de trazer e buscar novidades. Principal atuação em Start-up e Desenvolvimento de sistemas para o mercado financeiro. Atuação Backend com PHP e Java. Tenho atuado Como Scrum Master na Keyrus dentro do projeto Carrefour<br \/>Certificado CSM - Certified ScrumMaster","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/20bffccb612f6b2e7fec88af1b7d5661.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/39"}]},{"id":40,"title":"NoSQL + SQL = PostgreSQL","shortDescription":"Atualmente existe muito impasse sobre afirmações que NoSQL atendem melhor as necessidades de armazenamento do que seus predecessores Relacionais. Veremos como o PostgreSQL pode ajudar devido as suas capacidades Relacionais e Não Relacionais, onde podemos ter o melhor dos dois mundos.","description":"Atualmente existe muito impasse sobre afirmações que NoSQL atendem melhor as necessidades de armazenamento e processamento de dados em laraga escala do que seus predecessores Relacionais.<br \/>Veremos como o PostgreSQL pode ajudar devido as suas capacidades Relacionais e Não Relacionais, onde podemos ter o melhor dos dois mundos criando modelos híbridos e também integrando outras tecnologias como MongoDB, Cassandra, HBase, etc.","requirements":"Programação, SQL, Bancos de Dados","type":"talk","date":"2017-12-09","startTime":"11:30","endTime":"12:30","room":"Sala Er Galvão","speaker":{"id":135,"name":"Fabrízio de Royes Mello","description":"Como Especialista de Banco de Dados na Timbira, ajudo pessoas e times na correta utilização do PostgreSQL. Voluntário da Comunidade Brasileira de PostgreSQL, apoio nas listas de discussão, organização de eventos e administração. Também ajudo o PostgreSQL Global Development Group na revisão e desenvolvimento de funcionalidades.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/de602cfe5ed51098bfcceb251cb3fcf1.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/40"}]},{"id":78,"title":"12 factor in the PHP world","shortDescription":"Os 12 fatores são uma lista de boas práticas que projetos e times podem aplicar para rodar seus aplicativos na núvem","description":"Os 12 fatores são uma lista de boas práticas que projetos e times podem aplicar para rodar seus aplicativos na núvem<br \/>Nesta palestra vou apresentar cada um dos fatores, suas vantagens e como aplicá-los em projetos PHP","requirements":"Conhecimentos básicos em PHP e núvem","type":"talk","date":"2017-12-09","startTime":"11:30","endTime":"12:30","room":"Sala Flavio Lisboa","speaker":{"id":207,"name":"Elton Minetto","description":"Elton  Minetto possui graduação em Ciência de Computação pela Unochapecó e especialização em Ciência da Computação pela UFSC\/UNOESC.  É autor do livro Frameworks para Desenvolvimento em PHP, da editora Novatec, co-autor do livro Grid Computing in Research and Education, publicado pela editora IBM\/Redbooks, EUA e autor dos e-books Zend Framework na prática, Zend Framework 2 na prática, Iniciando com o Zend Framework 2 e Doctrine na Prática.<br \/>É co-fundador da Coderockr e Zend Framework Evangelist","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/b27cdfb83e1d98bf8f2df259ac8e1793.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/78"}]},{"id":21,"title":"PHP funcional: além do array_map","shortDescription":"Programação funcional é um conceito muito poderoso mas<br \/>superficialmente utilizado em PHP. Nessa palestra vamos entender como ir<br \/>além do array_map para fazer seus programas atingirem novos níveis de<br \/>sofisticação.<br \/><br \/>","description":"Vamos entender a história da programação funcional. Como se<br \/>compara a outros paradigmas. Vamos analisar conceitos de<br \/>programação funcional. Mesmo não sendo uma linguagem especializada<br \/>em programação funcional as últimas versões do PHP avançaram<br \/>bastante no que se pode fazer em programas funcionais.<br \/><br \/><br \/>## Tópicos:<br \/> - Funções puras<br \/> - Funções de alta ordem<br \/> - Currying<br \/> - Pattern matching<br \/> - Monoides<br \/>","requirements":"Saber programarPror","type":"talk","date":"2017-12-09","startTime":"11:30","endTime":"12:30","room":"Sala Ricardo Coelho","speaker":{"id":191,"name":"Jean Carlo Machado","description":"My name is Jean Carlo Machado. I'm a 22 years old, professional Backend developer at Compufour. I studied Análise e Desenvolvimento de Sistemas at IFRS-BG.<br \/><br \/>I'm in love with science and technology in general. I really appreciate Open Source and the Unix Way. I know several programming languages but I do reserve special interest for PHP, C and Bash script. My hobbies include: boggling, to play violin, reading and programming; sporadically some electronics stuff or painting. But maybe the thing I do the most is to look for ways to improve my development process.<br \/>","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/5a21880b8cc2d120e3a084f89549425e.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/21"}]},{"id":80,"title":"Gestão Empresarial com ERPHP","shortDescription":"Apresentação de um framework que contempla todas as funcionalidades envolvidas em um sistema de Gestão (ERP e similares).","description":"Hoje um dos ambientes de desenvolvimento de Sistemas de Gestão (ERPs e similares) mais usados no mercado Cloud é baseado no PHP para a parte de Regras de Negócio, SQL para o armazenamento e acesso aos dados e HTML5 com Java Script e JQuery para as telas de entrada de dados e apresentação das consultas. Os frameworks disponíveis no mercado não se concentram nas necesssidades específicas desses tipos de aplicação. Qualquer desenvolvedor que for criar um sistema que envolva uma tela de cadastramento, uma de movimentação e uma de consulta dos dados precisa partir do zero e criar um código usando os comandos básicos dessas quatro linguagens. Inexistem funções poderosas que facilitem o seu trabalho a ponto de conseguir resolver esse desafio em questão de horas. Além de ter que desenvolver todas as funcionalidades básicas como emissão de NFe, controle financeiro, de estoque, tratamento de nossa legislação fiscal, contabilidade, entre outras. O framework que vamos apresentar contempla todos esses recursos e necessidade","requirements":"Nenhum","type":"talk","date":"2017-12-09","startTime":"14:00","endTime":"15:00","room":"Sala Elton Minetto","speaker":{"id":322,"name":"ernesto haberkorn","description":"Socio fundador da TOTVS e atualmente Diretor Técnico do ERPFlex e da TI Educacional. <br \/>1965 a 1968:programador 1401 na Metal Leve<br \/>1968 a 1970: programador Gama 10 na Bull<br \/>1970 a 1974 Programador Assembler na ESC<br \/>1974 a 1983: Programador Assembler na SIGA<br \/>1983 a 2006: Programador Clipper e AdvPL na Microsiga\/TOTVS<br \/>2006 a atual: Programador PHP\/JS\/HTML\/SQL no ERPFlex da TI Educacional ","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/05d906c2e1058f7bcf4af94ca12e95dd.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/80"}]},{"id":71,"title":"O que aprendi pelo caminho. 30 questões que todo o desenvolvedor deve levar para a vida profissional.","shortDescription":"Durante o decorrer da palestra, serão abordados assuntos pertinentes e que a maioria dos desenvolvedores já passou uma vez na vida profissional e pessoal. Desde hábitos profissionais até mesmo pessoais que afetam de uma maneira ou de outra a vida do desenvolvedor de software.","description":"São 30 conselhos, ordenados não por importância, mas pelas lembranças de um dev que errou, aprendeu e ainda aprende com a maioria delas, com algumas, ainda paga o preço.<br \/><br \/>Confia demais na memória? Pega qualquer trabalho que vem pela frente? Vai dormir as 4h da manhã e acordar as 6 para trabalhar no emprego \"oficial\"? São alguns dos pontos abordados.<br \/><br \/>Apesar de considerar como conselhos, também são reflexões pessoais, notas de auto-ajuda escritas por quem as vezes pensa demais ou de menos.","requirements":"Sem pré requisitos","type":"talk","date":"2017-12-09","startTime":"14:00","endTime":"15:00","room":"Sala Er Galvão","speaker":{"id":285,"name":"Johnathan Cardoso","description":"Desenvolvedor PHP há cerca de quinze anos. Formado em Gestão de Tecnologia da Informação pelo SENAC e concluinte de sistemas de Informação pela UNISUL. É um dos coordenadores do PHPSC (www.phpsc.com.br) e desde 2007 envolvido no crescimento e profissionalização da comunidade PHP.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/e6e5dcd0302c3d4a645ab682ade8f155.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/71"}]},{"id":32,"title":"Criptografia com PHP","shortDescription":"Iremos ver conceitos básicos e intermediários de criptografia e como utilizá-los de forma correta (e também o que não fazer) no PHP.<br \/>Veremos criptografias simétrica e assimétrica, hashing, assinaturas, vetores de inicialização, cifras, modos de operação e geradores de aleatoriedade.","description":"Criptografia é a prática (e o estudo) que consiste em transformar uma informação (texto claro) em um código cifrado, para que apenas as pessoas (ou em nosso caso, sistemas) escolhidos possam decifrar. Pontos que serão abordados:<br \/>- Tipos de criptografia (simétrica e assimétrica)<br \/>- Vetores de inicialização, cifras e modos de operação<br \/>- Boas (e más) práticas<br \/>- Hashing (alternativas a MD5 e SHA1)<br \/>- Garantindo autenticidade via assinaturas (HMAC)<br \/>- (Bons) Geradores de aleatoriedade","requirements":"Não há requisitos","type":"talk","date":"2017-12-09","startTime":"14:00","endTime":"15:00","room":"Sala Flavio Lisboa","speaker":{"id":123,"name":"Vinícius Campitelli","description":"Desenvolvedor PHP desde os 16 anos, apaixonado por tecnologia e principalmente Web. Responsável pela área de desenvolvimento da @MediaPost - E-mail Marketing e co-fundador do Curseduca, uma startup na área de e-learning.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/a533d090fb6f95f169707e0573800243.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/32"}]},{"id":88,"title":"Monitorando sua aplicação com logs","shortDescription":"Vou apresentar como centralizar os logs em uma ferramenta como o ELK (https:\/\/www.elastic.co\/webinars\/introduction-elk-stack) e o loggly (https:\/\/www.loggly.com\/). Vou mostrar como criar dashboards para acompanhar a saúde da aplicação e extrair informações úteis para o negócio. ","description":"Gostaria de apresentar uma palestra voltada a log, aonde vou apresentar como centralizar os logs em uma ferramenta como o ELK (https:\/\/www.elastic.co\/webinars\/introduction-elk-stack) e o loggly (https:\/\/www.loggly.com\/). Vou mostrar como criar dashboards para acompanhar a saúde da aplicação e extrair informações úteis para o negócio. Na mesma apresentação vou mostrar como utilizar ferramentas de tracking de erro para capturar exceptions, erros e warning e ser notificado via um meio de comunicação como slack ou e-mail. As ferramentas que gostaria de apresentar são sentry (https:\/\/sentry.io), rollbar (https:\/\/rollbar.com) e o airbrake (https:\/\/airbrake.io\/). Gostaria de dar mais ênfase no ELK e Sentry pois são ferramentas open source. As outras ferramentas vou passar por cima. Vou utilizar o PHP 7 com monolog. Para integrar o monolog com as ferramentas mencionadas vou utilizar os handlers do monolog:","requirements":"Não informado","type":"talk","date":"2017-12-09","startTime":"14:00","endTime":"15:00","room":"Sala Ricardo Coelho","speaker":{"id":274,"name":"Diego Henrique Sousa Saouda","description":"Bacharel em Ciência da Computação pela Universidade de Guarulhos, atua na área de Engenharia de Software utilizando Java, NodeJS e princialmente PHP. Fã de Docker e micro frameworks como silex e expressive. Nós últimos anos tem trabalhado com WEB Crawlers, normalizando as informações capturadas e expondo uma API para consumo dessas informações. ","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/63fc79abf3ba31e4bbd97fbd2eb1abaa.png","0":"png"},"links":[{"rel":"self","uri":"\/talks\/88"}]},{"id":56,"title":"Processamento avançado de vídeos com PHP e ffmpeg","shortDescription":"O ffmpeg é uma ferramenta poderosíssima para trabalhar com vídeo. Muitos apenas a conhecem como uma ferramenta para fazer encoding de vídeos em diferentes formatos, mas ela pode ser usada para criar e combinar vídeos, imagens, texto e efeitos. ","description":"O ffmpeg é uma ferramenta poderosíssima para trabalhar com vídeo. Muitos apenas a conhecem como uma ferramenta para fazer encoding de vídeos em diferentes formatos, mas ela pode ser usada para criar e combinar vídeos, imagens, texto e efeitos. <br \/><br \/>Nessa palestra, explicarei um pouco sobre o sistema de filtros do ffmpeg, como combiná-los para criar composições complexas, e como usar o PHP e a biblioteca php-ffmpeg para criar e aplicar filtros em aplicações reais.","requirements":"conhecimento intermediário de php","type":"talk","date":"2017-12-09","startTime":"15:00","endTime":"16:00","room":"Sala Elton Minetto","speaker":{"id":121,"name":"Aryel Tupinambá","description":"Co-fundador e CTO da LQDI Digital, dirige e desenvolve projetos para empresas como Porto Seguro, Nestlé, Edenred \/ Ticket, Terra Networks, Grupo Whirlpool, Tishman-Speyer e Editora Abril. Engenheiro da Computação pela FIAP\/SU, trabalha com PHP e desenvolvimento web há mais de 12 anos, desde os primórdios do PHP e da era ponto-com.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/8c794e547023a2a38229323fbe40c8b0.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/56"}]},{"id":63,"title":"PHP: Extending The Core - Why you should learn it","shortDescription":"Já pensou em contribuir com o core do PHP, construir um driver para acessar um hardware ou até mesmo adicionar uma nova feature na linguagem ? Nesta talk você não só vai aprender a construir sua própria extensão para PHP, mas mudará também sua forma de programar, dissecando os internals da linguagem","description":"Nessa talk faremos um deep-dive nos internals do PHP, entendendo como as engrenagens giram por debaixo do capô quando executamos nosso código, isto é, a arquitetura da linguagem, o ciclo de vida de execução e algumas de suas estruturas internas. Tudo isso, é claro, com um olhar crítico sobre como desenvolvemos código hoje e como podemos melhorar amanhã. Vamos também desenvolver uma extensão explorando os limites da linguagem, tanto à nível de escopo quanto à nível de performance.","requirements":"C (básico), PHP (todos os níveis), *nix OS","type":"talk","date":"2017-12-09","startTime":"15:00","endTime":"16:00","room":"Sala Er Galvão","speaker":{"id":151,"name":"Lucas Mendes","description":"Desenvolvedor desde a era do Microsoft FrontPage, atualmente trabalha como Software Architect na Nuvem Shop (Tienda Nube), responsável pela definição, implantação e manutenção de uma complexa arquitetura de micro-serviços. Aspirante à Cientista da Computação pela PUC Minas, evangelista PHPMG, palestrante e contribuidor em diversos projetos Open Source tendo como foco tecnologias e ferramentas voltadas para web e aplicações modernas. Nas horas livres gosta de escrever rascunhos de artigos para seu blog pessoal, aprender uma linguagem nova e incomodar os vizinhos ouvindo Rock N Roll.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/40eb90fd95ac28c531a4da31132ed2d8.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/63"}]},{"id":50,"title":"Clean Code: Por um mundo com código melhores","shortDescription":"O principal objetivo dessa apresentação é colaborar para um mundo melhor. Um mundo onde as pessoas se importem com o código que está sendo desenvolvido. Por isso reuni os principais conceitos do CleanCode, uma forma de codificar projetada para facilitar a escrita, a leitura e a manutenção.","description":"O principal objetivo dessa apresentação é colaborar para um mundo melhor. Um mundo onde as pessoas se importem com o código que está sendo desenvolvido. Por isso reuni os principais conceitos do CleanCode, uma forma de codificar projetada para facilitar a escrita, a leitura e a manutenção.","requirements":"Nenhum","type":"talk","date":"2017-12-09","startTime":"15:00","endTime":"16:00","room":"Sala Flavio Lisboa","speaker":{"id":333,"name":"Thiago Barradas","description":"Entusiasta de novas tecnologias na MundiPagg, evangelizador de Elasticsearch, Team Manager e Developer Full Stack, cultuador do hábito de integrar e formar cabeças pensantes. Apaixonado por música e natureza. ","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/a287468418039c42117088c2f1a12deb.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/50"}]},{"id":41,"title":"PHP e PostgreSQL: Um é pouco, dois é bom, três é demais","shortDescription":"A intenção dessa apresentação é demostrar e explorar diversos recursos que o PostgreSQL oferece ao desenvolvedor PHP, e como desfrutar destes por meio da extensão php_pgsql e também por meio da PDO (PHP Data Objects). Veremos como é possível desenvolver aplicações ninjas com essa dupla de elefantes.","description":"Desenvolver uma aplicação em PHP com PostgreSQL é uma combinação interessante, pois permite criar apps web escaláveis e de alta performance, bem como serviços, jobs, etc. Mas na maioria das vezes o uso fica limitado a conectar, executar um SQL e desconectar do banco de dados. <br \/><br \/>Porém a extensão PostgreSQL para PHP implementa uma série de recursos interessantes: queries assincronas, notificação assincrona, bulk load, BLOBs, cursores, consultas preparadas, etc. Veremos um pouco desses recursos.","requirements":"Programação PHP, Banco de Dados, SQL","type":"talk","date":"2017-12-09","startTime":"15:00","endTime":"16:00","room":"Sala Ricardo Coelho","speaker":{"id":135,"name":"Fabrízio de Royes Mello","description":"Como Especialista de Banco de Dados na Timbira, ajudo pessoas e times na correta utilização do PostgreSQL. Voluntário da Comunidade Brasileira de PostgreSQL, apoio nas listas de discussão, organização de eventos e administração. Também ajudo o PostgreSQL Global Development Group na revisão e desenvolvimento de funcionalidades.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/de602cfe5ed51098bfcceb251cb3fcf1.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/41"}]},{"id":8,"title":"Análise de segurança e hacking de containers Docker","shortDescription":"Nesta apresentação serão abordados cenários comuns em que a implantação de imagens Docker abrem novos tipos de problemas de segurança que talvez você não tenha considerado e algumas ferramentas e dicas que você pode usar para garantir que não deixe as portas abertas quando você implantar em produção","description":"Para usar Docker você precisa estar ciente de algumas boas práticas relacionadas ao uso de contêineres com segurança, se usadas corretamente, pode fornecer um sistema mais seguro e eficiente do que usando máquinas virtuais (VMs).<br \/>Mas para isso, tanto em produção como em desenvolvimento, você precisa conhecer os benefícios e os possíveis problemas de segurança e das principais ferramentas e técnicas para proteger sistemas baseados em contêineres. ","requirements":"datashow","type":"talk","date":"2017-12-09","startTime":"16:30","endTime":"17:30","room":"Sala Elton Minetto","speaker":{"id":311,"name":"Fernando Silva","description":"Analista de Desenvolvimento na KingHost, graduado em Análise e Desenvolvimento de Sistemas (ADS) pela Faculdade Senac Porto Alegre, onde ganhou o Prêmio Keller de melhor trajetória acadêmica. Atualmente faz pós-graduação em Segurança Cibernética pela UFRGS, além disso, é um dos coordenadores da comunidade PHP-RS, é entusiasta Open Source e Software Livre.<br \/>","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/0db2cd86c2c9df622c285505d0ba4262.JPG","0":"JPG"},"links":[{"rel":"self","uri":"\/talks\/8"}]},{"id":57,"title":"Fazendo seu Google: criando robôs de coleta de dados de sites com PHP","shortDescription":"Nesta palestra conheceremos o arsenal do PHP para leitura automatizada de dados em servidores. O objetivo é mostrar como se constroem rastreadores web (crawlers), programas utilizados por motores de busca para coletar dados em sites. ","description":"Inicialmente vamos fazer uma revisão histórica sobre o papel dos sistemas de busca para Internet e tentar mostrar que podemos atuar e forma independente usando PHP, criando nossas próprias soluções que trabalhem sobre um espaço de busca que nos traga os resultados que queremos ou precisamos, sem a dúvida de que algo ficou perdido em alguma página muito, muito distante. Partiremos em seguida para uma demonstração prática de como PHP pode buscar e extrair informações de sites de forma direta.","requirements":"conhecimentos de lógica de programação","type":"talk","date":"2017-12-09","startTime":"16:30","endTime":"17:30","room":"Sala Flavio Lisboa","speaker":{"id":122,"name":"Flávio Gomes da Silva Lisboa","description":"Bacharel em Ciência da Computação com pós-graduação em Aplicações Corporativas usando Orientação a Objetos e Tecnologia Java pela e mestrando em Tecnologia e Sociedade pela UTFPR. É funcionário do SERPRO e autor dos livros: Zend Framework Desenvolvendo em PHP 5 Orientado a Objetos com MVC, Zend Framework Componentes Poderosos para PHP (2ª ed.),Criando Aplicações PHP com Zend e Dojo (2ª ed.) e Orquestrando Aplicações PHP com Symfony usando ORM Doctrine. É Zend PHP Certified Engineer, Zend Framework Certified Engineer, Zend Framework 2 Certified Architect. Tem experiência na área de Ciência da Computação, com ênfase em Software Livre. Sua especialidade é arquitetura de software. Atualmente faz pesquisa em Economia Solidária e Tecnologia Social.","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/27dbee7afb8f0dc09b22124a931bcb5f.png","0":"png"},"links":[{"rel":"self","uri":"\/talks\/57"}]},{"id":86,"title":"Open Source: Mais do que códigos públicos","shortDescription":"Por muito tempo o conceito de open source foi, literalmente ao pé da letra, como um código disponível em algum repositório para qualquer um ver e usar (público) foi mantido. Mas tudo evolui, e tudo que é bom normalmente tem seu conceito ampliado. Vamos descobrir tudo que esse conceito abrange.","description":"Por muito tempo o conceito de open source foi, literalmente ao pé da letra, como um código disponível em algum repositório para qualquer um ver e usar(público) foi mantido. Mas tudo evolui, e tudo que é bom normalmente tem seu conceito ampliado. Vamos descobrir tudo que esse conceito abrange e como podemos aplica-lo nos detalhes do nosso dia-a-dia.","requirements":"Nenhum.","type":"talk","date":"2017-12-09","startTime":"16:30","endTime":"17:30","room":"Sala Ricardo Coelho","speaker":{"id":333,"name":"Thiago Barradas","description":"Entusiasta de novas tecnologias na MundiPagg, evangelizador de Elasticsearch, Team Manager e Developer Full Stack, cultuador do hábito de integrar e formar cabeças pensantes. Apaixonado por música e natureza. ","photo":"http:\/\/phpconference.com.br\/media\/images\/palestrante\/\/a287468418039c42117088c2f1a12deb.jpg","0":"jpg"},"links":[{"rel":"self","uri":"\/talks\/86"}]}]}